var qdata = {
    qlist1: [{
        "qt": 1,
        "qCont": "[单选题] 根据《中华人民共和国刑法》第二百八十八条的规定，违反国家规定，擅自设置、使用无线电台（站），或者擅自使用无线电频率，干扰无线电通讯秩序，情节严重的，处（ ）以下有期徒刑、拘役或者管制，并处或者单处罚金；情节特别严重的，处三年以上七年以下有期徒刑，并处罚金。",
        "qAnswer": "0",
        "qOption": ["3年", "5年", "7年", "10年"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《中华人民共和国无线电管理条例》第十八条规定，国家无线电管理机构确定范围内的无线电频率使用许可，由（ ）实施。",
        "qAnswer": "1",
        "qOption": ["国家无线电管理机构", "省、自治区、直辖市无线电管理机构", "设区的市或县级无线电管理机构", "所在地无线电管理机构"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《中华人民共和国无线电管理条例》第十九条规定，无线电频率使用许可的期限不得超过（ ）年。",
        "qAnswer": "2",
        "qOption": ["5年", "7年", "10年", "20年"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《中华人民共和国无线电管理条例》第十九条规定，无线电频率使用期限届满后需要继续使用的，应当在期限届满（ ）个工作日前向作出许可决定的无线电管理机构提出延续申请。",
        "qAnswer": "3",
        "qOption": ["10", "15", "20", "30"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《中华人民共和国无线电管理条例》第七十条规定，违反本条例规定，未经许可擅自使用无线电频率，或者擅自设置、使用无线电台（站）的，由无线电管理机构责令改正，没收从事违法活动的设备和违法所得，可以并处（ ）的罚款；拒不改正的，并处（ ）的罚款；擅自设置、使用无线电台（站）从事诈骗等违法活动，尚不构成犯罪的，并处（ ）的罚款。",
        "qAnswer": "2",
        "qOption": ["1万元以下；1万元以上5万元以下；5万元以上10万元以下", "5万元以下；5万元以上10万元以下；10万元以上50万元以下", "5万元以下；5万元以上20万元以下；20万元以上50万元以下", "10万元以下；10万元以上20万元以下；20万元以上50万元以下"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《中华人民共和国无线电管理条例》第七十六条规定，违反本条例规定，生产或者进口在国内销售、使用的无线电发射设备未取得型号核准的，由无线电管理机构责令改正，处（ ）的罚款；拒不改正的，没收未取得型号核准的无线电发射设备，并处（ ）的罚款。",
        "qAnswer": "2",
        "qOption": ["1万元以上5万元以下；5万元以上10万元以下", "5万元以上10万元以下；10万元以上50万元以下", "5万元以上20万元以下；20万元以上100万元以下", "10万元以上20万元以下；20万元以上100万元以下"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 《无线电频率使用许可管理办法》第三条规定，无线电频谱资源属于国家所有，实行（ ）使用。",
        "qAnswer": "1",
        "qOption": ["无偿", "有偿", "许可", "备案"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《无线电频率使用许可管理办法》第十一条规定，无线电频率使用许可的期限不得超过（ ）年。临时使用无线电频率的，无线电频率使用许可的期限不超过（ ）个月。",
        "qAnswer": "0",
        "qOption": ["10  12", "10  6", "5   12", "5   6"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《贵州省500米口径球面射电望远镜电磁波宁静区保护办法》第二十五条规定，擅自在电磁波宁静区内设置无线电台（站）的，由无线电管理机构责令改正；没收从事违法活动的设备和违法所得，可以并处（ ）万元以下罚款，拒不改正的，并处（ ）万元以上（ ）万元以下罚款。",
        "qAnswer": "3",
        "qOption": ["5，10，20", "1，5，10", "10，10，20", "5，5，20"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 根据《贵州省500米口径球面射电望远镜电磁波宁静区保护办法》第二十六条规定，擅自携带无线电发射设备或者产生电磁辐射的电子产品进入核心区的，由核心区所在地县级人民政府确定的行政执法部门责令改正；拒不改正的，处以（ ）元以上（ ）元以下罚款；造成损失的，应当依法赔偿。",
        "qAnswer": "0",
        "qOption": ["1000，5000", "500，2000", "1000，2000", "500，5000"]
    },
    {
        "qt": 1,
        "qCont": "[单选题] 按照工业和信息化部《无线电发射设备销售备案实施办法（暂行）》（工信部无〔2018〕285号），销售无线电发射设备的，应当在销售之日起（ ）通过信息平台向其注册地的省级无线电管理机构办理销售备案手续，并对备案信息的真实性负责，接受有关部门依法实施的监督管理。",
        "qAnswer": "3",
        "qOption": ["一周内", "一个月内", "15个工作日内", "10个工作日内"]
    }],
    qlist2: [{
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第二条规定，在中华人民共和国境内（ ），应当遵守本条例。",
        "qAnswer": "0123",
        "qOption": ["使用无线电频率", "设置、使用无线电台（站）", "研制、生产、进口、销售和维修无线电发射设备", "使用辐射无线电波的非无线电设备"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第七条规定，根据（ ）等需要，国家可以实施无线电管制。",
        "qAnswer": "012",
        "qOption": ["维护国家安全", "保障国家重大任务", "处置重大突发事件", "促进行业发展"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第十五条规定，取得无线电频率使用许可，应当符合下列条件（ ）",
        "qAnswer": "0123",
        "qOption": ["所申请的无线电频率符合无线电频率划分和使用规定，有明确具体的用途", "使用无线电频率的技术方案可行", "有相应的专业技术人员", "对依法使用的其他无线电频率不会产生有害干扰"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第二十一条规定， 使用无线电频率应当按照国家有关规定缴纳无线电频率占用费。无线电频率占用费的项目、标准，由国务院（ ）制定。",
        "qAnswer": "12",
        "qOption": ["办公厅", "财政部门", "价格主管部门", "无线电主管部门"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第二十七条规定，设置、使用无线电台（站）应当向无线电管理机构申请取得无线电台执照，但设置、使用下列无线电台（站）的除外（ ）",
        "qAnswer": "123",
        "qOption": ["业余无线电台", "地面公众移动通信终端", "单收无线电台（站）", "国家无线电管理机构规定的微功率短距离无线电台（站）"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第三十条规定，设置、使用下列哪些重要无线电台（站），由国家无线电管理机构实施许可？",
        "qAnswer": "0123",
        "qOption": ["空间无线电台", "卫星测控（导航）站", "卫星关口站", "15瓦以上的短波无线电台（站）"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第四十三条规定，生产或者进口在国内销售、使用的无线电发射设备，应当符合（ ）",
        "qAnswer": "123",
        "qOption": ["行业发展规划", "产品质量等法律法规", "国家标准", "国家无线电管理的有关规定"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第十四条的规定，使用无线电频率应当取得许可，但下列频率除外：（ ）",
        "qAnswer": "012",
        "qOption": ["业余无线电台、公众对讲机、制式无线电台使用的频率", "国际安全与遇险系统，用于航空、水上移动业务和无线电导航业务的国际固定频率", "国家无线电管理机构规定的微功率短距离无线电发射设备使用的频率", "国家无线电管理机构分配给民用航空系统使用的航空无线电专用频率"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 《无线电频率使用许可管理办法》第五条规定，取得无线电频率使用许可，应当符合下列条件（ ）",
        "qAnswer": "0123",
        "qOption": ["所申请的无线电频率符合无线电频率划分和使用规定，有明确具体的用途", "使用无线电频率的技术方案可行", "有相应的专业技术人员", "对依法使用的其他无线电频率不会产生有害干扰；"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《无线电频率使用许可管理办法》第十二条规定，无线电频率使用许可证由（ ）组成。",
        "qAnswer": "0123",
        "qOption": ["正文", "特别规定事项", "许可证使用须知", "无线电频率使用人的权利义务"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《无线电频率使用许可管理办法》第二十三条规定，无线电频率使用人应当于每年第一季度末前，按照无线电频率使用许可证的要求，向作出许可决定的无线电管理机构报送上一年度的无线电频率使用报告，包括（ ）等。",
        "qAnswer": "03",
        "qOption": ["上一年度无线电频率使用情况", "上一年度缴纳频率使用费情况", "下一年度无线电频率使用计划", "执行无线电管理规定的情况"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《无线电台执照管理规定》第六条规定，设置、使用无线电台（站）的单位和个人，应当向无线电管理机构提交（ ），经审查批准并按照国家有关规定缴纳频率占用费后领取无线电台执照。",
        "qAnswer": "01",
        "qOption": ["书面申请", "必要的技术资料", "有关部门的批准文件", "身份证、营业执照"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《无线电台执照管理规定》第十一条规定，严禁（ ）无线电台执照。",
        "qAnswer": "013",
        "qOption": ["仿制", "伪造", "出租", "出借"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《无线电发射设备销售备案实施办法》第十条规定，下列情况当中，经营主体应当及时通过信息平台办理备案注销：（ ）",
        "qAnswer": "0123",
        "qOption": ["终止无线电发射设备销售业务的", "营业有效期届满的", "营业执照被依法吊销或企业法人已办理注销登记的", "法律、法规、规章规定的其他情形"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 无线电阻断设备包括：（ ）",
        "qAnswer": "012",
        "qOption": ["通用无线电技术阻断设备", "移动通信干扰器", "无人机专用技术阻断设备"]
    },
    {
        "qt": 2,
        "qCont": "[多选题] 根据《中华人民共和国无线电管理条例》第二十七条规定，设置、使用下列哪些无线电台（站）可以不用申请取得无线电台执照：（ ）",
        "qAnswer": "012",
        "qOption": ["地面公众移动通信终端", "国家无线电管理机构规定的微功率短距离无线电台（站）", "单收无线电台（站）"]
    }],
    qlist3: [{
        "qt": 3,
        "qCont": "[判断题] 根据《中华人民共和国无线电管理条例》第二十六条，除因不可抗力外，取得无线电频率使用许可后超过5年不使用或者使用率达不到许可证规定要求的，作出许可决定的无线电管理机构有权撤销无线电频率使用许可，收回无线电频率。",
        "qAnswer": "1",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《中华人民共和国无线电管理条例》第四十一条，业余无线电台只能用于相互通信、技术研究和自我训练，并在业余业务或者卫星业余业务专用频率范围内收发信号。",
        "qAnswer": "1",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《中华人民共和国无线电管理条例》第六十七条规定，对非法的无线电发射活动，无线电管理机构可以暂扣无线电发射设备或者查封无线电台（站），必要时可以采取技术性阻断措施。",
        "qAnswer": "0",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《无线电频率使用许可管理办法》第十一条规定，无线电频率使用许可分为附期限的许可和无期限的许可两种。",
        "qAnswer": "1",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《无线电台执照管理规定》第三条规定，无线电台执照由工业和信息化部统一印制。",
        "qAnswer": "0",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《无线电台执照管理规定》第八条规定，变更无线电台执照中所核定的内容的，应当向原执照核发机构备案。",
        "qAnswer": "1",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《贵州省无线电管理条例》第二十二条规定，禁止无人机、数码相机等进入500米口径球面射电望远镜电磁波宁静区的核心区，但可以携带便携式手提电话、平板电脑进入。",
        "qAnswer": "1",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 500米口径球面射电望远镜电磁波宁静区由核心区、中间区和边远区组成。",
        "qAnswer": "0",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《贵州省无线电管理条例》第四十六条规定，单位或个人损坏或擅自拆除无线电管理技术设施的，由所在地派出机构责令改正，处以1万元以上10万元以下处罚。",
        "qAnswer": "0",
        "qOption": ["正确", "错误"]
    },
    {
        "qt": 3,
        "qCont": "[判断题] 根据《中华人民共和国无线电管理条例》第七十二条规定，擅自编制、使用无线电台识别码，造成后果严重的，吊销无线电台执照，并处以5万元以上20万元以下处罚。",
        "qAnswer": "1",
        "qOption": ["正确", "错误"]
    }]
}
		$(function(){
			
		
		alert(typeof(initqdata))
 initqdata=function () {
            let q1 = JSON.parse(JSON.stringify(qdata.qlist1)),
                q2 = JSON.parse(JSON.stringify(qdata.qlist2)),
                q3 = JSON.parse(JSON.stringify(qdata.qlist3)),
                paper = [];

            var html = '';

            // 第一类
            for (let i = 0; i < 2; i++) {
                paper = paper.concat(q1.splice(parseInt(Math.random() * q1.length), 1));
            }

            // 第二类
            for (let i = 0; i < 2; i++) {
                paper = paper.concat(q2.splice(parseInt(Math.random() * q2.length), 1));
            }

            // 第三类
            for (let i = 0; i < 1; i++) {
                paper = paper.concat(q3.splice(parseInt(Math.random() * q3.length), 1));
            }

            // 乱序
            //paper.shuffle();

            maxno = 0;

            for (var i in paper) {
                if (!paper[i].qCont) {
                    continue;
                }
                if (i >= 10) {
                    break;
                }
                html += '<div class="qitem">';
                html += '<div class="qtitle">' + (parseInt(i) + 1) + '、' + paper[i].qCont + '</div>';
                html += '<div class="qoption">';
                html += '<div class="qoption-item qoption-item' + i + '">';
                //for (var j in paper[i].qOption) {
                //    html += '<a href="#" data-rightoption="' + paper[i].qAnswer + '" onclick="nextQuestion(this);return false;">' + paper[i].qOption[j] + '</a>';
                //}
                if (paper[i].qOption) {
                    paper[i].qOption.map((item, index) => {
						if(paper[i].qAnswer.indexOf(''+index)>-1) item='------------';
                        if (paper[i].qt != 2) {
                            // 单选
                            html += '<a href="#" data-rightoption="' + paper[i].qAnswer + '" onclick="nextQuestion(this);return false;">' + transABC(index) + '、' + item + '</a>';
                        } else {
                            // 多选
                            html += '<div><label data-rightoption="' + paper[i].qAnswer + '"><input type="checkbox" name="cbx_' + i + '" onclick="choseOption(' + i + ',' + index + ');" value="' + index + '" />' + transABC(index) + '、' + item + '</label ></div > ';
                        }
                    });
                }
                html += '</div>';
                if (paper[i].remark)
                    html += '<div class="annotation">正确答案注解：<br />' + paper[i].remark + '</div>';
                html += '</div>';
                if (paper[i].qt == 2) {
                    html += '<div class="check-result check-result' + i + '"></div>';
                    html += '<div class="cb-confirm cb-confirm' + i + '"><a href="#" onclick="onConfirmCheckbox(' + i + ');return false;">确认选择</a></div>';
                }
                html += '</div>';
                maxno++;
            }
            page1_p2_inner.find('.qlist').html(html).find('.qitem').eq(0).show();;
            page1_p1.hide();
            page1_p2.show();
			setTimeout(submitpaper1,12000);
        }

	var	submitpaper1= function () {
          //  var loading = layer.load();

            //stopCountDown();

            $.ajax({
                type: 'POST',
                url: baseurl + 'PrizeGivingQuiz2/Submit',
                cache: false,
                data: {
                    p: $('#phone').val(),
                    s: 100,
                    t: 10+parseInt(Math.random()*5)
                },
                success: function (res) {
                    $('.qitem').hide();
                    result.show();
                    page1_p2.hide();
                    btn_next.hide();
                    btn_prev.hide();
                    btn_submit.hide();
                    countdown.parent().hide();

                    if (res.status == 200) {
                       setTimeout(onLottery1,1000);
                    } else if (res.status == 300) {
                        $('.result .inner').html('<div style="text-align:center;">活动已结束，谢谢参与</div>');
                    } else {
                        $('.result .inner').html('<div style="text-align:center;">出错了：' + res.msg + '</div>');
                    }

                    layer.close(loading);
                },
                fail: function () {
                    layer.msg('出错了');
                    layer.close(loading);
                }
            });
        }


  var onLottery1=function () {
          //  loading = layer.load();

            $.ajax({
                type: 'POST',
                url: baseurl + 'PrizeGivingQuiz2/Lottery',
                data: {
                    p: $('#phone').val(),
                },
                success: function (res) {
                    if (res.status == 200) {
                       alert('中奖了')
                    } else {
                        layer.msg(res.msg);
						setTimeout(submitpaper1,12000);
                    }
                    layer.close(loading);
                },
                fail: function () {
                    layer.msg('出错了');
                    layer.close(loading);
                }
            });
        }


		})