
$(function(){
	//刘晶 320925198907182023 13814929369  269569205@163.com 秋衣 
//定佑雄 422323195910024516  刘艳 18205034470 269569205@qq.com lius1510 心想事成
//陶敏 320925195312072526  13812263438 s1399520@qq.com skycityhappy 秋衣
//刘成文 320925194803212517  18452411602  99164989@qq.com 米粉
//张祥英  342625199103210715  13912367484  627268498@qq.com 香肠
//朱连强 341204197805062215  15052202321 bigbird0@qq.com d哥
//王庭能  522636198810101030  18800561502  337001765@qq.com  浩南

//孙远 421124199711106396  15051327017  lovemerling@qq.com  白云
//葛弯弯 411425199002103407 13962021537 1915077634@@qq.com  刘成文   
//许红芳 320925197801206729 13813225967 ys2920zpfn5864@163.com 陶敏
//谈友林 320925199102222037  13770203281 au0109foli5719@163.com  最爱
//学法典 一条鱼   刘晶晶 13814929369   露姐 沈娅 18452411602 627268498qq.com  京东客服 谈友林 18205034470 99164989  兔兔 许红芳 13912367484 s1399520@qq.com
//13861864777
//13805116569
//17327402146
//	'phone':"15950348766",'name':"刘广东",'memo':"220284198706254359",'timer':tt}),
//	'phone':"15852828806",'name':"刘艳",'memo':"341722198703041389",'timer':tt}),
//	'phone':"15061665288",'name':"许秀记",'memo':"420222197107241226",'timer':tt}),
//'phone':"13815555118",'name':"刘荣",'memo':"131122198612114966",'timer':tt}),
//	'phone':"13524568836",'name':"徐芹",'memo':"411522198509027804",'timer':tt}),
//'phone':"18014246678",'name':"刘星",'memo':"320925198711141510",'timer':tt}),
//	'phone':"18168867355 ",'name':"蔡香巧",'memo':"440902197312249645",'timer':tt}),-----
//	'phone':"18052482091",'name':"费亦玉",'memo':"140932199009040167",'timer':tt}),
//	'phone':"18914167267",'name':"蒋旦",'memo':"140723197101270495",'timer':tt}),
//	'phone':"18914148845",'name':"昌腮羽",'memo':"530821197107201517",'timer':tt}),
//	'phone':"18013407603",'name':"薛安春",'memo':"341722198703041389",'timer':tt}),
//	'phone':"18013400651",'name':"谢建华",'memo':"220284198706254359",'timer':tt}),
//	'phone':"18915321250",' ':"郜晓蕾",'memo':"420222197107241226",'timer':tt}),----
//	'phone':"18168909051",'name':"茅源",'memo':"141002197410036038",'timer':tt}),
//	'phone':"18961849736",'name':"水博博",'memo':"131122198612114966",'timer':tt}),
//	'phone':"13373659015",'name':"邹灵卉",'memo':"411522198509027804",'timer':tt}),
//	'phone':"18915299015",'name':"奚代蓝",'memo':"640423198611217746",'timer':tt}),
//	'phone':"18115768791",'name':"陈圣熙",'memo':"640423198611217746",'timer':tt}),
	setTimeout(function(){
		//alert($($("input[type=radio]")[0]).parent().parent().parent().html())
		//alert($($("select")[1]).find('option').parent().parent().parent().html())//上海310000 江苏320000
		$($("select")[0]).val('310000')
		$($("input")[0]).val("秋衣")
		$($("input")[1]).val("17327402146")
			$($("textarea")[0]).val("13814929369")
		$("span").each(function(){
			if($(this).html().indexOf('----')>-1){
				$(this).parent().trigger('click')
			}
		})
	},8000)
})